import {AppImages} from "../utils/AppImages";

/**
 * Demo data blog items
 */
export const BlogDemoData = [
    {
        id: 1,
        img: AppImages.temp.blog_item2,
        title: "Деградируй или проиграешь",
        subheader: "July 8, 2020",
        text: "- Революционер, готовь батискаф если пойдешь против коллектива. Тебе больше всех надо? О каком порядке ты говоришь? Не смеши. На всех уровнях беспорядок. Вот ты знаешь как можно сделать нашу работу в срок в такой обстановке без нарушения правил? Все просчитать невозможно. Невозможно и повлиять на вышестоящие инстанции. Малявы что ли предлагаешь строчить наверх? Да, люди не совершенны, с этим придется смириться. Ошибки будут. А что правила? Их придумали, но все равно никто им не следует. По правилам все бы давно уже развалилось. Знаешь как говорят умные люди: “правила даны чтобы их нарушать”. Не, ну не все конечно. Некоторые важны. За их нарушение можно и штраф схлопотать. Но все подряд - смешно. Ты только неприятности наживешь, если будешь добиваться, чтобы все по правилам. Кто таких задротов любит? Ты вот сегодня опоздал на 2 минуты, давай тебя по правилам без выходных оставим. Нет в правилах? Вот я же говорю толку от них ноль. Специально для тебя допишем, не вопрос. Давай лучше начнем решать конкретные проблемы. Нужно обсуждать их. О причинах проблем пусть думают те, кому за это платят. Ты что любишь бесплатно работать? Может помоешь у меня полы дома? Устроим тебе субботник как в совке делали для блеваков-дегенератов. Не нравится - вали, за тобой стоит толпа жаждущих работать. Есть идея как помочь поднять тебе сознательность. Я ушел на обед, а ты работай, говорят что на голодный желудок лучше думается.",
    },
    {
        id: 2,
        img: AppImages.temp.blog_item1,
        title: "Становление философии",
        subheader: "June 16, 2020",
        text: "Термин философия произошел от греческих слов - филео  - любовь, софия - мудрость. Это особая умственная деятельность, направленная на всеобъемлющее рациональное осмысление мира. Анализ фундаментальных вопросов мироздания и роли человека в нем. \n" +
            "\n" +
            "Философия зародилась примерно 3 тысячи лет назад, в первом веке до нашей эры. Традиционно возникновение слов “философия” и “философ” приписывают Пифагору, древнегреческому мудрецу, математику, мистику. Большой вклад в раскрытие термина сделал Платон. Аристотель, ученик Платона, укрепил и расширил понятие.\n" +
            "\n" +
            "До Платона философия в основном собирала в себя житейскую мудрость в виде символических и художественных форм. Платон, а затем и Аристотель изменили ситуацию. Они вышли за рамки просто “любви к мудрости”. Они старались создать философию, как последовательное целостное учение. Учение, которое должно было опираться на прочный фундамент, который они нашли в понятийных формах, логическими средствами. \n" +
            "\n" +
            "Сам же предмет философия сформировался как преодоление ограниченных типов мировоззрения - мифологии и первоначальных форм религий. Философия пошла по своему пути отбросив авторитеты и традицию - критически изучая мир, освобождаясь от предрассудков. \n" +
            "\n" +
            "Древнегреческая философия предложила большой перечень разных ответов: на проблему строения целостного бытия; о безграничной делимости природы; представления о наличии последних пределов, или последних мельчайших частиц вещества; о всепроникающем единсве всего сущего. Каждый человек, наделенный разумом, мог участвовать в сознательном поиске и выборе представлений. И выбор был свободен, основан на критике, на аргументах и обосновании той или иной концепции.\n" +
            "\n" +
            "С момента появления философия, не беспочвенно, претендовала на главенствующую роль в науке. Во времена зарождения философия имела регистрационный характер (за исключением некоторых чисто дедуктивных наук таких как математика, логика). Философия выступала как единственная наука, которая может дать теоретическое объяснение всего происходящего в мире и в самом человеке.\n" +
            "\n" +
            "Эпоха Нового времени, начавшаяся в семнадцатом веке знаменуется отделением некоторых наук из под покровительства философии. Они становятся способны самостоятельно объяснять физические процессы, тем самым перестают нуждаться в поддержке философии. Роль философии меняется. Она теряет свое доминирующие положение над наукой. Начинается поиск новой ниши философии и уточнение ее роли.\n" +
            "\n" +
            "Еще важную роль для поиска новых представлений сыграла сильная взаимосвязь философии с религией. Христианство на заре своего существования для объяснения и углубления своих постулатов взяла на вооружение философию. В дальнейшем религия приобрела монополию над духовной жизнью человека. Философия же приобрела роль хотя и важного, но по большей части вспомогательного, технического, орудия. “Философия - служанка богословия” фраза, появившаяся в Средние века, хорошо характеризует состояние философии в те времена.\n" +
            "\n" +
            "На фоне роста значимости и авторитета науки, все более и более вырисовывалась потребность по отделению в самостоятельном статусе и независимости от богословия. Что в эпоху Нового времени с успехом было реализовано. Философии не только удалось восстановить статус, но и отодвинуть на периферию жизни религию и богословие.\n" +
            "\n" +
            "Часто философию рассматривают как научное знание особого типа. Мнение о представлении философии как науки наиболее полно выражено в трудах Маркса и Энгельса. Были и противоположные взгляды. Основоположники позитивизма считали что позитивные науки, то есть конкретные, делают философию ненужной, лишней, избыточной.\n" +
            "\n" +
            "Большое распространение получило мнение в том, что философия должна опираться исключительно на собственные силы, на средства рационального постижения мира, на силы, таящиеся в человеческом интеллекте. Образовалось новое понимание предмета философии. Она приобрела форму рационализированного мировоззрения.\n" +
            "\n" +
            "Также, в то время приобрела развитие концепция создания обобщенной, универсальной картины мира. Считалось, что будет создана философская система, которая будет всеобщей, и человечество всегда должно будет придерживаться ее. Подобные претензии на создание “последней” завершенной системы выражены в наиболее характерных образцах философии того времени: учении Гегеля и марксизме. \n" +
            "\n" +
            "На протяжении всего времени понятие философии постоянно изменялось и уточнялось. Следующее коренное изменение произошло в середине 19го века. В истории философии можно выделить несколько этапов развития: становление и развитие традиционной философии, этап классической философии, и этап неклассической философии, который длится до сих пор. \n" +
            "\n" +
            "Важным аспектом, выделяющим неклассические философии, является отсутствие претензий на создание всеобщего учения. Сама постановка подобной повестки ошибочна. Человеческое сознание всегда обусловлено социальными историческими и культурными обстоятельствами. Так как разум ограничен, невозможно претендовать на абсолютное познание последней и окончательной истины. \n" +
            "\n" +
            "На неклассической стадии развития философия уже не рассматривает разум как самодостаточное основание. Разум рассматривается в контексте социально-историческом, как ограниченный в своих познавательных возможностях и исторически изменчивый. Не в смысле его ограниченности в целом. Он имеет ограниченность в контексте времени. Это не глухая стена. Но на каждый этап развития существует предел, который он в историческом движении преодолевает. \n" +
            "\n" +
            "Неклассическая философия лишает сознание того статуса, на котором он был в классический период. Лишая себя основания неклассический этап философии пытается найти какие-то другие основоположения, которые могли бы явиться посредником между бытием и человеческим сознанием.\n" +
            "\n" +
            "В современной философии подобным посредником служит язык. Он включает в себя не только обычный разговорный язык, но также все средства коммуникации и общения от математических формул до художественно символических средств. Особый акцент на этой стороне познания делается в таких течениях философии как лингвистическая философия, постпозитивизм, герменевтика. \n" +
            "\n" +
            "Так же важнейшим связующим средством бытия и сознания выступает культура - в широком понимании. Под культурой понимается вся совокупная творчески созитаельная деятельность и продукты этой деятельности. Это не только произведения культуры, но и все практически преобразующая деятельность. Культура - это все, что отличается от естественного, все, что несет в себе малейший отпечаток следов человеческого воздействия. \n" +
            "\n" +
            "Развитие философии продолжается. Как и три тысячи лет назад человек, наделенный разумом, может поучаствовать в ее развитии. И ты - тот самый человек, который дочитал эту статью до конца.",
    },
    {
        id: 3,
        img: AppImages.temp.blog_item6,
        title: "Оптимизация процессов",
        subheader: "May 30, 2020",
        text: "Оптимизировать можно все. Даже оптимизацию можно оптимизировать. Правильный подход позволит значительно сократить время. А время, всем известно, это деньги.\n" +
            "\n" +
            "Цели\n" +
            "\n" +
            "Оптимизация должна принести повышение производительности. Отговорки звучат нелепо. Какая разница кто виноват в провале? Оптимизация проведена с ошибками. “Неучтенка” - это ошибка. Всегда существуют миллионы причин. Как наркоман найдет миллионы причин для дозы, программист найдет миллион причин провалу. Смотрите на вещи в масштабе - стали вы сегодня быстрей чем вчера?\n" +
            "\n" +
            "Команда\n" +
            "\n" +
            "Выявите плюсы и минусы каждого члена команды. При подготовке к оптимизации нужно знать кто на что способен. Ты не можешь сделать все сам. Нужно верно распределить роли. Если дать не ту роль человеку, он может все завалить. Дай роль конфликтолога вспыльчивому невоспитанному человеку - он всех поссорит.\n" +
            "\n" +
            "Куда бить\n" +
            "\n" +
            "Определите топ проблемы без углубления в частности. Я не устану всем повторять - частности не важны. Важна суть. Вот вы человек? Думаю, что да. Что важнее: что вы человек или что у вас есть нос? Уберите нос - вы останетесь человеком. Так же и с проблемами. Уберите частность - проблема останется. Нужно бить не по частностям, а по конкретной проблеме!\n" +
            "\n" +
            "Сокращайте код\n" +
            "\n" +
            "В каждой строке кода скрыта логика приложения. Чем меньше строк, тем меньше логики. Сократив количество кода, вы сократите сложность приложения, упростите поддержку, а значит и часы работы. Золотое правило программирования - “Упрощай и сокращай”. Это же правило является золотым и при оптимизации. \n" +
            "\n" +
            "Инкапсулируй\n" +
            "\n" +
            "Думаю, это ясно всем по коду. Но в жизни это тоже пригодится. Не смешивай разные понятия в кучу. Не забывайте про объемы. Не делайте логических ошибок.\n" +
            "\n" +
            "Рефакторинг\n" +
            "\n" +
            "Улучшай свой код. Улучшай свои навыки. Каждую строку, которую ты написал, можно написать лучше, не говоря уже об огромных проектах. Не трать время впустую, займись делом - ты станешь быстрее.\n" +
            "\n" +
            "Изучайте рабочую среду\n" +
            "\n" +
            "Мы живем не во времена emacs, но даже он был невероятно огромен. Сейчас любая среда имеет кучу возможностей для ускорения процессов производства продукта. Изучайте ее. Не избегайте написания собственных плагинов.\n" +
            "\n" +
            "Автоматизируй\n" +
            "\n" +
            "У каждого есть каждодневная рутинная работа. И ее можно автоматизировать. Изучите вы наконец shell. Не бойтесь вы командной строки - это ваш друг. Спросите совета у тех, кто разбирается в этом. Вот вы знаете что на windows есть WSL и bash? \n" +
            "\n" +
            "Учитесь\n" +
            "\n" +
            "Читайте книги. И не книги “помоги себе сам”, “как стать за 7 дней...”. Книги по фунадментальным наукам. Начните с логики, например, она серьезно чистит разум от шлака. Непросто после ~10ти часового рабочего дня еще и учиться - берите то, что вам по душе, но с фундаментом.\n" +
            "\n" +
            "\n" +
            "Прогресс - направление развития от низшего к высшему. Оптимизируя свою скорость, ты стремишься от текущей скорости к высшей - ты прогрессируешь. Развивайся! Оставь регресс и низшее недоразвитым.",
    },
    {
        id: 4,
        img: AppImages.temp.blog_item3,
        title: "Количество станет качеством",
        subheader: "May 6, 2020",
        text: "Насколько важна логика? Многие используют этот термин, не подозревая что это. Не зная основных законов. Это печально. Но даже они спинным мозгом понимают, что это основа правильного мышления. Мы с вами люди сведущие, знаем насколько. Но сколько из нас знают диалектику? Мой спинной мозг подсказывает - не многие... \n" +
            "\n" +
            "Я о диалектической философии Гегеля, не перепутайте с “первобытной” диалектикой. В философии Гегеля противоречие рассматривается, как движущий принцип развития. В формальной же - противоречия рассматриваются, как логическая ошибка. Он противопоставил диалектическую логику формальной логике Аристотеля.\n" +
            "\n" +
            "«Нет предмета, в котором нельзя было бы найти противоречия, то есть противоположных определений, так как не противоречащий себе предмет есть чистое отвлечение рассудка, насильственно удерживающего одну из двух определенностей и старающегося затемнить и устранить сознание другой определенности, содержащейся в первой»\n" +
            "\n" +
            "Но противопоставление Гегеля нужно понимать не отрицанием, а поглощением. Чтобы что-то оттолкнуть нужно за это взяться. Мир противоречив, и в своем противоречии он един. \n" +
            "\n" +
            "В диалектической логике есть три важных закона, которые дополняют понимание принципов устройства мира. Я их вспоминаю каждый день. Объясню почему.\n" +
            "\n" +
            "Закон единства и борьбы противоположностей\n" +
            "\n" +
            "“В мире нет таких явлений, которые бы находились вне процесса бесконечного развития, внутри всякой целостности”\n" +
            "\n" +
            "Нет без борьбы развития. Хочешь прогресса - борись.\n" +
            "\n" +
            "Закон отрицания отрицания \n" +
            "\n" +
            "“Преемственность, связь нового со старым, своего рода повторяемость на высшей стадии развития некоторых свойств ряда низших стадий”\n" +
            "\n" +
            "Развиваясь, вы дополняете то что уже было. Старое не пропадает, оно обрастает новым.\n" +
            "\n" +
            "Закон перехода количественных изменений в качественные\n" +
            "\n" +
            "“Накопление количественных изменений для любого процесса приводит к скачку от старого качества к новому”\n" +
            "\n" +
            "Это мой любимый закон. Твои старания не напрасны. Количество всегда переходит в качество. Это обнадеживает и помогает каждый день стараться сделать еще больше чем ты сделал вчера. И результат не заставит себя ждать.\n" +
            "\n" +
            "Все, что вы делаете превратится в итоге в качество, а значит развитие не остановить.\n"
    },
    {
        id: 5,
        img: AppImages.temp.blog_item5,
        title: "Дурные привычки",
        subheader: "September 14, 2016",
        text: "Вы курите? Часто называют это привычкой. Подмена понятий. Это зависимость. Манипуляция или глупость тех, кто называет это привычкой. Мы сегодня поговорим о привычках.\n" +
            "\n" +
            "Привычка - сложившийся способ поведения, осуществление которого в определённой ситуации приобретает для индивида характер потребности. Некоторые привычки сложились еще до нашего рождения: обусловленные обществом, некоторые мы приобрели с генами, некоторые пестуем сами.\n" +
            "\n" +
            "Привычки общества - это те, которые нам навязывают пропагандой, воспитанием. Например, привычка ходить на выборы, которые ничего не решают. Привычка хвалиться отпуском в кредит, новым айфоном, найком с китая и т.д. Эти привычки создают проблемы, покупка нового айфона встанет вам в копеечку.\n" +
            "\n" +
            "Привычки генов - самые сложные. Они прошиты в вас, как gnu в linux. Плохие из них те, которые мешают жить. Например - доброта. В рыночной экономике, экономике джунглей каждый сам за себя, она приносит проблемы. Доброта…Она бесплатна.\n" +
            "\n" +
            "Борьба с привычками приобретенными легче предыдущих двух - тут вы один на один с проблемой. Над вами нет довлеющий пропаганды. Нет физической предрасположенности. Но задача не проста. Если вы годами ее создавали, не думайте, что победите ее за недели. Пример такой привычки - грызть ногти. \n" +
            "\n" +
            "Для борьбы с дурными привычками нужно понять с каким типом мы имеем дело. “Общественная” - борьба с такой породит противодействие общества, нужно быть готовым к этому. “Генная” - ее не победить, нужно приспособится, найти обходные варианты. “Приобретенная” - забороть один на один. \n" +
            "\n" +
            "Удачи в борьбе с дурными привычками.\n" +
            "Удачи в борьбе с дурными.\n" +
            "Удачи в борьбе.\n" +
            "Удачи.",
    },
    {
        id: 6,
        img: AppImages.temp.blog_item4,
        title: "Основы логики",
        subheader: "September 14, 2016",
        text: "Логика – это наука, изучающая закономерности структуры и развития правильного мышления как процесса познавательной деятельности, осуществляемой с помощью языка. \n" +
            "\n" +
            "Мыслить логически — значит устанавливать истинность и ложность суждений, неопределенность и бессмысленность утверждений, находить связи между явлениями и внутренние причины явлений, уметь выдвигать новые идеи в процессе рассуждений. \n" +
            "\n" +
            "Главная цель логики заключается в установлении принципов и правил обоснования рассуждений в процессу познания действительности. Каждое рассуждение является процессом познания. Логика учит думать, аргументированно и правильно дискутировать, спорить. При изучении этой науки вырабатывается привычка думать правильно. \n" +
            "\n" +
            "FYI. Мнение. Михаил Васильевич Ломоносов: \"для научного познания необходим природный рассудок, подкрепленный логикой, которая после грамматики, есть первая предводительница ко всем наукам\"",
    },
];